Repository: F-i-f/soft-brightness
Catalog: po/*.po
Languages: cs, fa, nl, tr

source: Soft Brightness Plus
cs: Softwarová regulace jasu
fa: روشنایی ملایم
nl: Zachte helderheid

source: Version
cs: Verze
fa: نسخه
nl: Versie
tr: Sürüm

source: Use backlight control:
cs: Použít ovládání podsvětlení:
fa: ادغام در کنترل روشنایی صفحه نمایش:
nl: Achtergrondverlichtingsregeling gebruiken:
tr: Arka ışık kontrolünü kullan:

source: Monitor(s):
cs: Monitory:
fa: صفحه نمایش:
nl: Beeldscherm(en):
tr: Monitör(ler):

source: All
cs: Všechny
fa: همه
nl: Alle
tr: Tümü

source: Built-in
cs: Vestavěný
fa: اصلی
nl: Ingebouwd
tr: Yerleşik

source: External
cs: Externí
fa: خارجی
nl: Extern
tr: Harici

source: Built-in monitor:
cs: Vestavěný displej:
fa: صفحه نمایش اصلی:
nl: Ingebouwd beeldscherm:
tr: Yerleşik monitör:

source: Full-screen behavior:
cs: Chování v celoobrazovkovém režimu:
fa: عملکرد در نمای تمام‌صفحه:
nl: Gedrag bij beeldvullende toepassingen:
tr: Tam ekran davranışı:

source: Do not enforce brightness in full-screen
cs: Nevynucovat jas v celoobrazovkovém režimu
fa: عدم اجرا در نمای تمام‌صفحه
nl: Helderheidsniveau niet afdwingen
tr: Tam ekranda parlaklığı zorunlu kılma

source: Brightness enforced in full-screen
cs: Vynutit úroveň jasu v celoobrazovkovém režimu
fa: اجرا در نمای تمام‌صفحه
nl: Helderheidsniveau afdwingen
tr: Tam ekranda uygulanan parlaklık

source: Brightness enforced in full-screen, always tear-free
cs: Vynutit úroveň jasu v celoobrazovkovém režimu, bez zaškubávání
fa: اجرا در نمای تمام‌صفحه، بدون تکه‌تکه شدن تصویر
nl: Helderheidsniveau afdwingen, scheurvrij
tr: Tam ekranda uygulanan parlaklık, her zaman yırtılmaz

source: Minimum brightness (0..1):
cs: Minimální jas (0..1):
fa: حداقل روشنایی (از ۰ تا ۱):
nl: Minimumniveau: (0..1):
tr: Minimum parlaklık (0..1):

source: Mouse cursor brightness control:
fa: کنترل روشنایی نشانگر ماوس:
nl: Helderheid van cursor:
tr: Fare imleci parlaklık kontrolü:

source: Debug:
cs: Ladění:
fa: حالت اشکال‌زدایی:
nl: Foutopsporing:
tr: Hata ayıklama:

source: Copyright © 2019-2022 Philippe Troin (<a href="https://github.com/F-i-f">F-i-f</a> on GitHub)
cs: Autorská práva © 2019-2022 Philippe Troin (<a href="https://github.com/F-i-f">F-i-f</a> na portálu GitHub)
nl: Copyright © 2019-2022 Philippe Troin (<a href="https://github.com/F-i-f">F-i-f</a> op GitHub)
tr: Telif hakkı © 2019-2022 Philippe Troin (GitHub'da <a href="https://github.com/F-i-f">F-i-f</a>)

source: Use backlight control.
cs: Použít ovládání podsvícení.
fa: ادغام در کنترل روشنایی صفحه نمایش.
nl: Gebruik achtergrondverlichtingsregeling.
tr: Arka ışık kontrolünü kullan.

source: Use the regular backlight control.
cs: Použít ovládání jasu v hardware.
fa: استفاده از کنترل روشنایی عادی.
nl: Gebruik de standaard achtergrondverlichtingsregeling.
tr: Normal arka ışık kontrolünü kullan.

source: Monitors.
cs: Monitory.
fa: صفحات نمایش.
nl: Beeldschermen.
tr: Monitörler.

source: The monitors whose brightness should be adjusted.
cs: Monitory, kterých jas upravit.
fa: صفحات نمایشی که باید روشناییشان تنظیم شود.
nl: De beeldschermen waarvan de helderheid moet worden aangepast.
tr: Parlaklığı ayarlanması gereken monitörler.

source: Builtin monitor.
cs: Vestavěný displej.
fa: صفحه نمایش اصلی.
nl: Ingebouwd beeldscherm.
tr: Dahili monitör.

source: The name of the built-in monitor.
cs: Název pro vestavěný displej.
fa: نام صفحه نمایش اصلی.
nl: De naam van het ingebouwde beeldscherm.
tr: Yerleşik monitörün adı.

source: Prevent window unredirecting behavior.
cs: Prevence nepřesměrovávání oken.
fa: غیرفعال کردن حالت ترسیم خارج صفحه (unredirection) پنجره.
nl: Voorkom vensterschaling.
tr: Pencere yeniden yönlendirme davranışını önle.

source: If set to never, unredirection is never prevented. If set to when-correcting, unredirection will be prevented when the brightness is not at the maximum setting (and an alpha layer is lowering the brightness). If set to always, window unredirection will always be prevented when this extension is active, allowing tear-free display.
cs: „never“: nepřesměrování není bráněno. „when-correcting“: nepřsměrování bude bráněno, když úroveň není na maximu (a alfa vrstva jas snižuje). „always“: nepřesměrovávání oken bude bráněno vždy, když je toto rozšíření aktivní, čímž se zabrání záškubům při zobrazování (vertikální synchronizace).
fa: در صورتی که گزینه‌ی هرگز انتخاب شود، ترسیم خارج صفحه (unredirection) مجاز خواهد بود. در صورت انتخاب گزینه‌ی هنگام اصلاح، هنگامی که روشنایی در مقدار حداکثری‌اش نباشد (یک لایه آلفا روشنایی را کاهش داده باشد)، از ترسیم خارج صفحه جلوگیری می‌شود. با انتخاب گزینه‌ی همیشه، تا زمانی که این افزونه فعال باشد، از ترسیم خارج صفحه جلوگیری شده و تکه‌تکه شدن تصویر اتفاق نخواهد افتاد.
nl: Stel in op ‘never’ om schaling te voorkomen. Stel in op ‘when-correcting’ om schaling te voorkomen als de helderheid niet op zijn hoogst staat (en een alfalaag de helderheid verlaagt). Stel in op ‘always’ om schaling altijd te voorkomen, alsmede scheuren.
tr: Hiçbir zaman olarak ayarlanırsa, yeniden yönlendirme asla engellenmez. Düzeltme sırasında ayarlanırsa, parlaklık maksimum ayarda olmadığında (ve bir alfa katmanı parlaklığı düşürdüğünde) yeniden yönlendirme engellenecektir. Her zaman olarak ayarlanırsa, bu uzantı etkin olduğunda pencere yeniden yönlendirmesi her zaman engellenecek ve yırtılmasız görüntü sağlanacaktır.

source: Minimum brightness.
cs: Minimální jas.
fa: حداقل روشنایی.
nl: Het minimumniveau.
tr: Minimum parlaklık.

source: Minimum brightness level.
cs: Minimální úroveň jasu.
fa: حداقل میزان روشنایی.
nl: Het minimum helderheidsniveau.
tr: Minimum parlaklık seviyesi.

source: Current brightness level.
cs: Stávající úroveň jasu.
fa: میزان روشنایی فعلی.
nl: Huidige helderheidsniveau.
tr: Mevcut parlaklık seviyesi.

source: The current brightness level.
cs: Stávající úroveň jasu.
fa: میزان روشنایی فعلی.
nl: Het huidige helderheidsniveau.
tr: Mevcut parlaklık seviyesi.

source: Mouse cursor brightness control.
fa: کنترل روشنایی نشانگر ماوس.
nl: Regel de helderheid van de cursor.
tr: Fare imleci parlaklık kontrolü.

source: When enabled, the mouse cursor follows the brightness setting. When disabled, the mouse cursor always remains at full brightness. Controlling mouse cursor brightness can sometimes show the wrong cursor and introduce cursor lag. You may want to disable it if you encounter cursor issues. Note that if another Gnome Shell component clones the mouse (like the Zoom accessibility feature), the cursor will follow the screen brightness.
fa: هنگام فعال بودن، نشانگر ماوس از تنظیمات روشنایی پیروی خواهد کرد. هنگام غیرفعال بودن، نشانگر ماوس با روشنایی تمام نشان داده می‌شود. این گزینه ممکن است باعث شود گاهی اوقات نشانگر اشتباهی نمایش داده شود یا باعث تأخیر در نمایش آن شود. در صورت مواجه با مشکل، این گزینه را غیرفعال کنید. توجه کنید که اگر افزونه‌ی دیگری از پوسته‌ی گنوم، نشانگر ماوس را شبیه‌سازی کند (مانند قابلیت بزرگنمایی صفحه)، نشانگر ماوس از روشنایی صفحه نمایش پیروی خواهد کرد.
nl: Schakel in om de cursor de helderheidsinstelling te laten volgen. Schakel uit om de cursor altijd op volledige helderheid te tonen. Als een ander onderdeel (zoals de vergrootglasfunctie) is ingeschakeld, dan wordt altijd de volledige helderheid gebruikt. Let op: inschakelen kan soms leiden tot het tonen van de verkeerde cursor en voor vertraging zorgen - schakel uit als u problemen ervaart.
tr: Etkinleştirildiğinde, fare imleci parlaklık ayarını takip eder. Devre dışı bırakıldığında, fare imleci her zaman tam parlaklıkta kalır. Fare imleci parlaklığını kontrol etmek bazen yanlış imleci gösterebilir ve imleç gecikmesine neden olabilir. İmleç sorunlarıyla karşılaşırsanız devre dışı bırakmak isteyebilirsiniz. Başka bir Gnome Shell bileşeni fareyi klonlarsa (Zoom erişilebilirlik özelliği gibi), imlecin ekran parlaklığını izleyeceğini unutmayın.

source: Debugging.
cs: Ladění.
fa: حالت اشکال‌زدایی.
nl: Foutopsporing.
tr: Hata ayıklama.

source: Enable debugging for the extension.
cs: Zapnout ladící režim rozšíření.
fa: فعال‌سازی حالت اشکال‌زدایی افزونه.
nl: Schakel foutopsporing van deze uitbreiding in.
tr: Uzantı için hata ayıklamayı etkinleştir.
